testCase1/0/film/delta
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/wallFilm";
    object      delta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(bottom|top)"
    {
        type            zeroGradient;
    }

    walls
    {
        type            zeroGradient;
    }

    filmWall
    {
        type            filmContactAngle;
        contactAngle
        {
            type            gravitational;
            theta0          70;
            thetaAdv        90;
            thetaRec        50;
            gTheta          0.1;
        }

        value           $internalField;
    }

    surface
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
