testCase1/0/film/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/film";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1 [bar];

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    top
    {
        type            zeroGradient;
    }

    bottom
    {
        type            fixedValue;
        value           $internalField;
    }

    walls
    {
        type            zeroGradient;
    }

    filmWall
    {
        type            zeroGradient;
    }

    // interface patch
    surface
    {
        type            mappedFilmPressure;
        value           $internalField;
    }
}


// ************************************************************************* //
