testCase1/0/fluid/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1e3;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(top|bottom)"
    {
        type            inletOutlet;
	    inletValue      $internalField;
	    value           $internalField;
    }

    "(walls|film)"
    {
        type            omegaWallFunction;
	    value           uniform 1e5;
    }
}

// ************************************************************************* //
