testCase1/0/fluid/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1 [bar];

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    top
    {
        type            fixedFluxPressure;
    }

    bottom
    {
        type            prghTotalPressure;
        p0              uniform 1 [bar];
    }

    film
    {
        type            fixedFluxPressure;
    }

    walls
    {
        type            fixedFluxPressure;
    }
}

// ************************************************************************* //
