testCase1/constant/film/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "constant";
    object          fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

filmCloudTransfer
{
    type            filmCloudTransfer;
    libs            ( "libfilmCloudTransfer.so" );
}

filmPhaseChangeToFluid
{
    type            filmPhaseChangeToFluid;
    libs            ( "libfilmPhaseChangeToFluid.so" );
    activeLiquid    IC8H18;
}


// ************************************************************************* //
