testCase1/constant/fluid/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "constant";
    object          fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

clouds
{
    type            clouds;
    libs            ( "liblagrangianParcel.so" );
}

fluidPhaseChangeToFilm
{
    type            fluidPhaseChangeToFilm;
    libs            ( "libfilmPhaseChangeToFluid.so" );
    patches         ( film );
}


// ************************************************************************* //
