testCase1/system/controlDict.1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            
( 
    "libfilmPhaseChangeToFluid.so" 
    "libfilmCloudTransfer.so" 
);

application     foamMultiRun;

regionSolvers
{
    fluid           multicomponentFluid;
    film            film;
}

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.600;

deltaT          1e-06;

writeControl    adjustableRunTime;

writeInterval   0.100;

purgeWrite      30;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1.0;

maxDeltaT       0.01;

OptimisationSwitches
{
    fileHandler     collated;
}

DebugSwitches
{
}



// ************************************************************************* //
