testCase1/system/film/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/wallFilm";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;

    div(phid,alpha)     Gauss vanLeer;
    div(phi,U)          Gauss limitedLinear 1;
    div(phi,e)          Gauss vanLeer;
    div(phi,h)          Gauss vanLeer;
    div(alphaRhoPhi,U)  Gauss limitedLinear 1;
    div(alphaRhoPhi,e)  Gauss limitedLinear 1;
    div(alphaRhoPhi,h)  Gauss limitedLinear 1;

    //div(nHat)           Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear uncorrected;
}

snGradSchemes
{
    default         uncorrected;
}


// ************************************************************************* //
