testCase1/system/film/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/film";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    alpha
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.01;

        minIter         1;
    }

    alphaFinal
    {
        $alpha;
        tolerance       1e-8;
        relTol          0;
    }

    "(U|e|h).*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.01;

        minIter         1;
    }

    "(U|e|h).*"
    {
        $U;
        tolerance       1e-8;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nCorrectors     1;

    outerCorrectorResidualControl
    {
        alpha
        {
            relTol      0;
            tolerance   1e-2;
        }
    }
}

relaxationFactors
{
    equations
    {
        alpha       0.95;
        U           0.9;
    }

    fields
    {
        alpha       0.95;
        U           0.9;
    }
}


// ************************************************************************* //
