testCase1/system/fluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default                      none;
    div(phid,p_rgh)              Gauss linearUpwind grad(U);
    div(phi,U)                   Gauss linearUpwind grad(U);
    div(phi,K)                   Gauss linearUpwind grad(U);
    div(phi,h)                   Gauss linearUpwind grad(U);
    div(phi,k)                   Gauss upwind;
    div(phi,epsilon)             Gauss upwind;
    div(phi,omega)               Gauss upwind;
    div(phi,Yi_h)                Gauss upwind;
}

laplacianSchemes
{
    default         Gauss linear uncorrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         uncorrected;
}

wallDist
{
    method          meshWave;
}

// ************************************************************************* //
