testCase1/system/fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|G)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.01;

        minIter         1;
    }

    "(rho|G)Final"
    {
        $rho;
        tolerance       1e-08;
        relTol          0;
    }

    "(U|h|Yi|O2|N2|IC8H18|epsilon|omega|k)"
    {
        //solver          PBiCGStab;
        //preconditioner  DILU;
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
        
        minIter         1;
    }

    "(U|h|Yi|O2|N2|IC8H18|epsilon|omega|k)Final"
    {
        $U;
        tolerance       1e-8;
        relTol          0;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-4;
        relTol          0.01;

        minIter         1;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-6;
        relTol          0;
    }
}

PIMPLE
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 1;
    momentumPredictor yes;
    turbOnFinalIterOnly false;
    transonic           false;
    outerCorrectorResidualControl
    {
        p
        {
            relTol        0;
            tolerance     1e-3;
        }
        U
        {
            relTol        0;
            tolerance     1e-4;
        }
    }
}

relaxationFactors
{
    fields
    {   
        "(p|p_rgh)" 0.7;
        U           0.9;
        k           0.5;
        omega       0.5;
    }

    equations
    {   
        "(p|p_rgh)" 0.7;
        U           0.9;
        k           0.5;
        omega       0.5;
    }
}

// ************************************************************************* //
